app/controllers/authentications_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def register
    user = User.new(user_params)
    if user.save