app/controllers/books_controller.rb

INSERT INTO "books" ("title", "image", "author", "isbn", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @book = @current_user.books.new(book_params)

    if @book.save