app/controllers/books_controller.rb

  def to_read
    @book = @current_user.books.find_by_title(params[:book][:title])
    @book = @current_user.books.new(book_params) if !@book
    @book.status = "to_read"

    if @book.save
---
SELECT  "books".* FROM "books" WHERE "books"."user_id" = $1 AND "books"."title" = $2 LIMIT $3  [["user_id", 1], ["title", "Harry Potter and the Cursed Child – Parts One and Two (Special Rehearsal Edition)"], ["LIMIT", 1]]
INSERT INTO "books" ("title", "image", "author", "isbn", "status", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "books" SET "status" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["status", "to_read"], ["updated_at", 2016-10-27 16:44:37 UTC], ["id", 1]]

  def read
    @book = @current_user.books.find_by_title(params[:book][:title])
    @book = @current_user.books.new(book_params) if !@book
    @book.status = "read"

    if @book.save
---
SELECT  "books".* FROM "books" WHERE "books"."user_id" = $1 AND "books"."title" = $2 LIMIT $3  [["user_id", 1], ["title", "Harry Potter and the Classical World"], ["LIMIT", 1]]
INSERT INTO "books" ("title", "image", "author", "isbn", "status", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "books" SET "status" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["status", "read"], ["updated_at", 2016-10-27 17:02:46 UTC], ["id", 1]]